/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#include	"STC8G_H_ADC.h"
extern u8 PD_mode;


//MF52A103F3950 (A1)		10K at 25, B = 3950, ADC = 12 bits
u16 temp_table[]={
	4041,    //  -55
	4039,    //  -54
	4036,    //  -53
	4032,    //  -52
	4028,    //  -51
	4024,    //  -50
	4019,    //  -49
	4014,    //  -48
	4008,    //  -47
	4002,    //  -46
	3995,    //  -45
	3988,    //  -44
	3981,    //  -43
	3973,    //  -42
	3965,    //  -41
	3957,    //  -40
	3948,    //  -39
	3938,    //  -38
	3928,    //  -37
	3918,    //  -36
	3908,    //  -35
	3897,    //  -34
	3885,    //  -33
	3873,    //  -32
	3861,    //  -31
	3847,    //  -30
	3834,    //  -29
	3820,    //  -28
	3805,    //  -27
	3790,    //  -26
	3774,    //  -25
	3758,    //  -24
	3741,    //  -23
	3723,    //  -22
	3704,    //  -21
	3685,    //  -20
	3665,    //  -19
	3644,    //  -18
	3623,    //  -17
	3601,    //  -16
	3577,    //  -15
	3553,    //  -14
	3529,    //  -13
	3503,    //  -12
	3476,    //  -11
	3449,    //  -10
	3420,    //  -9
	3391,    //  -8
	3361,    //  -7
	3330,    //  -6
	3298,    //  -5
	3265,    //  -4
	3231,    //  -3
	3196,    //  -2
	3161,    //  -1
	3123,    //  0
	3087,    //  1
	3049,    //  2
	3010,    //  3
	2971,    //  4
	2931,    //  5
	2890,    //  6
	2848,    //  7
	2806,    //  8
	2764,    //  9
	2721,    //  10
	2677,    //  11
	2633,    //  12
	2589,    //  13
	2544,    //  14
	2499,    //  15
	2454,    //  16
	2409,    //  17
	2363,    //  18
	2318,    //  19
	2272,    //  20
	2227,    //  21
	2182,    //  22
	2136,    //  23
	2091,    //  24
	2048,    //  25
	2002,    //  26
	1957,    //  27
	1913,    //  28
	1870,    //  29
	1826,    //  30
	1783,    //  31
	1741,    //  32
	1699,    //  33
	1658,    //  34
	1617,    //  35
	1577,    //  36
	1537,    //  37
	1498,    //  38
	1460,    //  39
	1422,    //  40
	1385,    //  41
	1348,    //  42
	1313,    //  43
	1277,    //  44
	1243,    //  45
	1209,    //  46
	1176,    //  47
	1144,    //  48
	1112,    //  49
	1082,    //  50
	1051,    //  51
	1022,    //  52
	993,    //  53
	965,    //  54
	937,    //  55
	911,    //  56
	884,    //  57
	859,    //  58
	834,    //  59
	810,    //  60
	787,    //  61
	764,    //  62
	742,    //  63
	720,    //  64
	699,    //  65
	679,    //  66
	659,    //  67
	639,    //  68
	621,    //  69
	603,    //  70
	585,    //  71
	568,    //  72
	551,    //  73
	535,    //  74
	519,    //  75
	504,    //  76
	490,    //  77
	475,    //  78
	462,    //  79
	448,    //  80
	435,    //  81
	422,    //  82
	410,    //  83
	399,    //  84
	387,    //  85
	376,    //  86
	365,    //  87
	355,    //  88
	345,    //  89
	335,    //  90
	325,    //  91
	316,    //  92
	307,    //  93
	299,    //  94
	290,    //  95
	282,    //  96
	274,    //  97
	267,    //  98
	259,    //  99
	253,    //  100
	245,    //  101
	239,    //  102
	232,    //  103
	226,    //  104
	220,    //  105
	214,    //  106
	208,    //  107
	202,    //  108
	197,    //  109
	192,    //  110
	187,    //  111
	182,    //  112
	177,    //  113
	172,    //  114
	168,    //  115
	163,    //  116
	159,    //  117
	155,    //  118
	151,    //  119
	147,    //  120
	143,    //  121
	139,    //  122
	135,    //  123
	132,    //  124
	129    //  125
};




//========================================================================
// 函数: void	ADC_Inilize(ADC_InitTypeDef *ADCx)
// 描述: ADC初始化程序.
// 参数: ADCx: 结构参数,请参考adc.h里的定义.
// 返回: none.
// 版本: V1.0, 2012-10-22
//========================================================================
void	ADC_Inilize(ADC_InitTypeDef *ADCx)
{
	ADCCFG = (ADCCFG & ~ADC_SPEED_2X16T) | ADCx->ADC_Speed;	//设置ADC工作时钟频率
	ADC_Justify(ADCx->ADC_AdjResult);		//AD转换结果对齐方式

	if(ADCx->ADC_SMPduty > 31)	return;	//错误
	if(ADCx->ADC_CsSetup > 1)	return;	//错误
	if(ADCx->ADC_CsHold > 3)	return;	//错误

	ADCTIM = (ADCx->ADC_CsSetup << 7) | (ADCx->ADC_CsHold << 5) | ADCx->ADC_SMPduty ;		//设置 ADC 内部时序，ADC采样时间建议设最大值
}


//========================================================================
// 函数: void	ADC_PowerControl(u8 pwr)
// 描述: ADC电源控制程序.
// 参数: pwr: 电源控制,ENABLE或DISABLE.
// 返回: none.
// 版本: V1.0, 2012-10-22
//========================================================================
void	ADC_PowerControl(u8 pwr)
{

	if(pwr == ENABLE)
	{
		if(!(ADC_CONTR & 0x80))
		{
			ADC_CONTR |= 0x80;
		}
	}
	else	ADC_CONTR &= 0x7f;
}

//========================================================================
// 函数: u16	Get_ADCResult(u8 channel)
// 描述: 查询法读一次ADC转换结果.
// 参数: channel: 选择要转换的ADC通道.
// 返回: ADC转换结果.
// 版本: V1.0, 2012-10-22
//========================================================================
u16	Get_ADCResult(u8 channel)	//channel = 0~15
{
	u16	adc;
	u8	i;

	if(channel > ADC_CH15)	return	4096;	//错误,返回4096,调用的程序判断	
	ADC_RES = 0;
	ADC_RESL = 0;

	ADC_CONTR = (ADC_CONTR & 0xf0) | ADC_START | channel; 
	NOP(10);			//对ADC_CONTR操作后等待会儿再访问

	for(i=0; i<250; i++)		//超时返回，正常i等于10以内就可以转换完成
	{
		if(ADC_CONTR & ADC_FLAG)
		{
			ADC_CONTR &= ~ADC_FLAG;
			if(ADCCFG &  (1<<5))		//转换结果右对齐。 
			{
				adc = ((u16)ADC_RES << 8) | ADC_RESL;
			}
			else		//转换结果左对齐。 
			{
				#if ADC_RES_12BIT==1
					adc = (u16)ADC_RES;
					adc = (adc << 4) | ((ADC_RESL >> 4)&0x0f);
				#else
					adc = (u16)ADC_RES;
					adc = (adc << 2) | ((ADC_RESL >> 6)&0x03);
				#endif
			}
			return	adc;
		}
	}
	return	4096;	//错误,返回4096,调用的程序判断
}



u16 ADC_MedianSample(u8 channel)
{
	u16    samples[SAMPLES_COUNT];
	u16 temp;
	u8 i,j;
	for (i = 0; i < SAMPLES_COUNT; i++)
	{
		samples[i] = Get_ADCResult(channel);
		delay_ms(2);
	}

	for (i = 0; i < SAMPLES_COUNT - 1; i++) 
	{
		for (j = 0; j < SAMPLES_COUNT - 1 - i; j++)
		{
			if (samples[j] > samples[j + 1]) 
			{
				temp = samples[j];
				samples[j] = samples[j + 1];
				samples[j + 1] = temp;
			}
    }
	}
	return samples[SAMPLES_COUNT / 2];
}


float ReadTemperature(void) {
	u16 adc_value = ADC_MedianSample(3);
	u8 i; 
	u8 length = sizeof(temp_table) / sizeof(temp_table[0]);
	if(adc_value >= temp_table[0]) return -55.0;
	if(adc_value <= temp_table[length-1]) return 125.0;
	for(i=0; i<length; i++)
	{
		if(temp_table[i] == adc_value) return  i - 55.0;
		if(i <= length-2)
		{
			if(temp_table[i] > adc_value  && temp_table[i+1] < adc_value ) return  i - 55.0 + ((float)(temp_table[i] - adc_value) / (temp_table[i] - temp_table[i+1]));
		}
	}
	return  -55.0;
}

float ReadInputVoltage(void) {
	return ADC_MedianSample(0)/4095.0 * Vref * 11;
}
